{
 "cells": [
  {
   "cell_type": "markdown",
   "id": "fa358ed3",
   "metadata": {},
   "source": [
    "# Лабораторная работа 2.8 Работа с функциями в языке Python"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "f13c88c8",
   "metadata": {},
   "source": [
    "**Цель работы:** приобретение навыков по работе с функциями при написании программ с\n",
    "помощью языка программирования Python версии 3.x."
   ]
  },
  {
   "cell_type": "markdown",
   "id": "8a36136b",
   "metadata": {},
   "source": [
    "**Задние 1.** Решить индивидуальное задание лабораторной работы 2.6, оформив каждую команду в виде\n",
    "отдельной функции."
   ]
  },
  {
   "cell_type": "markdown",
   "id": "f54cb625",
   "metadata": {},
   "source": [
    " Использовать словарь, содержащий следующие ключи: название пункта назначения рейса; номер рейса; тип самолета. Написать программу, выполняющую следующие действия: ввод с клавиатуры данных в список, состоящий из словарей заданной структуры; записи должны быть размещены в алфавитном порядке по названиям пунктов назначения; вывод на экран пунктов назначения и номеров рейсов, обслуживаемых самолетом, тип которого введен с клавиатуры; если таких рейсов нет, выдать на дисплей соответствующее сообщение."
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 1,
   "id": "c9ab282f",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "\n",
      "\n",
      "Выберите одну из опций: \n",
      "(1) Добавить новый рейс \n",
      "(2) Найти рейсы по типу самолета \n",
      "(3) Выход\n",
      ">> 1\n",
      "Введите название рейса: Ставрополь-Москва\n",
      "Введите номер рейса: 343\n",
      "Введите пункт назначения: Москва\n",
      "Введите тип самолета: Авиалайнер\n",
      "\n",
      "\n",
      "Выберите одну из опций: \n",
      "(1) Добавить новый рейс \n",
      "(2) Найти рейсы по типу самолета \n",
      "(3) Выход\n",
      ">> 1\n",
      "Введите название рейса: Москва-НьюЙорк\n",
      "Введите номер рейса: 132\n",
      "Введите пункт назначения: НьюЙорк\n",
      "Введите тип самолета: Авиалайнер\n",
      "\n",
      "\n",
      "Выберите одну из опций: \n",
      "(1) Добавить новый рейс \n",
      "(2) Найти рейсы по типу самолета \n",
      "(3) Выход\n",
      ">> 1\n",
      "Введите название рейса: НьюЙорк-Токио\n",
      "Введите номер рейса: 495\n",
      "Введите пункт назначения: Токио\n",
      "Введите тип самолета: Турбовинтовой\n",
      "\n",
      "\n",
      "Выберите одну из опций: \n",
      "(1) Добавить новый рейс \n",
      "(2) Найти рейсы по типу самолета \n",
      "(3) Выход\n",
      ">> 2\n",
      "\n",
      "Найти рейсы по типу самолета >> Авиалайнер\n",
      "Название рейса: Ставрополь-Москва\n",
      "Номер рейса: 343\n",
      "Пункт назначения: Москва\n",
      "Тип самолета: Авиалайнер\n",
      "--------------\n",
      "Название рейса: Москва-НьюЙорк\n",
      "Номер рейса: 132\n",
      "Пункт назначения: НьюЙорк\n",
      "Тип самолета: Авиалайнер\n",
      "--------------\n",
      "\n",
      "\n",
      "Выберите одну из опций: \n",
      "(1) Добавить новый рейс \n",
      "(2) Найти рейсы по типу самолета \n",
      "(3) Выход\n",
      ">> 3\n"
     ]
    }
   ],
   "source": [
    "flights = []\n",
    "\n",
    "\n",
    "def new_flight():\n",
    "    dictionary = {\n",
    "        'name': input('Введите название рейса: '),\n",
    "        'number': input('Введите номер рейса: '),\n",
    "        'destination': input('Введите пункт назначения: '),\n",
    "        'plane_type': input('Введите тип самолета: '),\n",
    "    }\n",
    "\n",
    "    return dictionary\n",
    "\n",
    "\n",
    "def set_flight(flight: {}):\n",
    "    flights.append(flight)\n",
    "\n",
    "\n",
    "def get_flight(plane_type: str):\n",
    "    arr = list(filter(lambda x: x.get('plane_type') == plane_type, flights))\n",
    "    return arr\n",
    "\n",
    "\n",
    "def print_flights(arr: []):\n",
    "    for elem in arr:\n",
    "        print(f'Название рейса: {elem.get(\"name\")}')\n",
    "        print(f'Номер рейса: {elem.get(\"number\")}')\n",
    "        print(f'Пункт назначения: {elem.get(\"destination\")}')\n",
    "        print(f'Тип самолета: {elem.get(\"plane_type\")}')\n",
    "        print('--------------')\n",
    "\n",
    "\n",
    "exit = True\n",
    "while (exit):\n",
    "    print('\\n')\n",
    "    print('Выберите одну из опций: \\n(1) Добавить новый рейс \\n(2) Найти рейсы по типу самолета \\n(3) Выход')\n",
    "    user_chose = input('>> ')\n",
    "\n",
    "    if user_chose == '1':\n",
    "        set_flight(new_flight())\n",
    "    elif user_chose == '2':\n",
    "        print_flights(get_flight(input('\\nНайти рейсы по типу самолета >> ')))\n",
    "    elif user_chose == '3':\n",
    "        exit = False\n",
    "    else:\n",
    "        print('Такой опции нет!')"
   ]
  }
 ],
 "metadata": {
  "kernelspec": {
   "display_name": "Python 3 (ipykernel)",
   "language": "python",
   "name": "python3"
  },
  "language_info": {
   "codemirror_mode": {
    "name": "ipython",
    "version": 3
   },
   "file_extension": ".py",
   "mimetype": "text/x-python",
   "name": "python",
   "nbconvert_exporter": "python",
   "pygments_lexer": "ipython3",
   "version": "3.9.7"
  }
 },
 "nbformat": 4,
 "nbformat_minor": 5
}
